Frontend/form_ajax.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2018-11-06 周二 03:47 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Form/Ajax</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/asset/common.css' />
</head>
<body>
<div id="content">
<header>
<h1 class="title">Form/Ajax</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgfa1d03b">1. XMLHttpRequest</a></li>
<li><a href="#org741c70c">2. Fetch API</a></li>
<li><a href="#org57d2e9e">3. jQuery</a></li>
</ul>
</div>
</nav>




<section id="outline-container-orgfa1d03b" class="outline-2">
<h2 id="orgfa1d03b"><span class="section-number-2">1</span> XMLHttpRequest</h2>
<div class="outline-text-2" id="text-1">
<p>
也算比较简单，需要掌握。不要没有 jQuery 就写不出代码，那样很危险。。
</p>

<div class="org-src-container">
<pre class="src src-js"><span class="org-comment-delimiter">// </span><span class="org-comment">&#21021;&#22987;&#21270;</span>
<span class="org-keyword">let</span> <span class="org-variable-name">xhr</span> = <span class="org-keyword">new</span> <span class="org-type">XMLHttpRequest</span>();

<span class="org-comment-delimiter">// </span><span class="org-comment">&#21487;&#20197;&#22686;&#21152;&#35831;&#27714;&#21442;&#25968;</span>
xhr.timeout = 3000;
xhr.reponseType = <span class="org-string">"text"</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">&#25171;&#24320;&#19968;&#37096;&#35831;&#27714;</span>
xhr.open(<span class="org-string">'POST'</span>, <span class="org-string">'/url'</span>, <span class="org-constant">true</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">&#21457;&#36865;&#35831;&#27714;&#65292;&#20801;&#35768;&#25658;&#24102;&#35831;&#27714;&#21442;&#25968;</span>
xhr.send(<span class="org-constant">null</span>);

<span class="org-comment-delimiter">// </span><span class="org-comment">&#20026;&#35831;&#27714;&#27880;&#20876;&#22238;&#35843;&#20989;&#25968;</span>
xhr.ontimeout = {...}
xhr.error = {...}
xhr.onprogress = {...}
xhr.upload.onprogress = {...}
xhr.onload = <span class="org-keyword">function</span> (<span class="org-variable-name">e</span>) {
    <span class="org-keyword">if</span>(<span class="org-constant">this</span>.status == 200) {
        alert(<span class="org-constant">this</span>.responseText);
    } <span class="org-keyword">else</span> {
        alert(<span class="org-constant">this</span>.statusText);
    }
};
</pre>
</div>
</div>
</section>

<section id="outline-container-org741c70c" class="outline-2">
<h2 id="org741c70c"><span class="section-number-2">2</span> Fetch API</h2>
<div class="outline-text-2" id="text-2">
<p>
旨在取代 XHR 的新标准，目前不是很成熟，但是日常测试使用很方便。
</p>

<p>
三个接口一个方法: <code>Headers/Request/Response</code>, <code>fetch()</code>，语法简洁。
</p>

<div class="org-src-container">
<pre class="src src-js">fetch(<span class="org-string">'/some.json'</span>, {
    method: <span class="org-string">'get'</span>,
    body: { id: 22 }
}).then(<span class="org-keyword">function</span> (<span class="org-variable-name">resp</span>) {
    resp.json().then(console.log);

}).<span class="org-keyword">catch</span>(<span class="org-keyword">function</span> (<span class="org-variable-name">r</span>) {
    console.err(r);
});
</pre>
</div>
</div>
</section>
<section id="outline-container-org57d2e9e" class="outline-2">
<h2 id="org57d2e9e"><span class="section-number-2">3</span> jQuery</h2>
<div class="outline-text-2" id="text-3">
<p>
语法示例:
</p>
<div class="org-src-container">
<pre class="src src-js">$.ajax({
    url: <span class="org-string">'/xxx'</span>,  <span class="org-comment-delimiter">// </span><span class="org-comment">&#20195;&#34920;&#35831;&#27714;&#30340;&#26381;&#21153;&#22120;&#22320;&#22336;</span>
    method: <span class="org-string">'get|post|put|patch|delete|options'</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">&#20351;&#29992;&#30340;&#35831;&#27714;&#26041;&#27861;</span>
    headers: {},  <span class="org-comment-delimiter">// </span><span class="org-comment">&#35774;&#32622;&#35831;&#27714;&#22836;</span>
    <span class="org-keyword">async</span>: <span class="org-constant">true</span>|<span class="org-constant">false</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">&#26159;&#21542;&#20351;&#29992;&#24322;&#27493;&#35831;&#27714;&#30340;&#26041;&#24335;</span>

    contentType: <span class="org-string">'application/x-www-form-urlencoded|...'</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">&#35831;&#27714;&#30340; enctype</span>
    data: <span class="org-string">'String'</span>|Object|Array, <span class="org-comment-delimiter">// </span><span class="org-comment">&#20256;&#36755;&#30340;&#25968;&#25454;</span>
    processData: <span class="org-constant">true</span>|<span class="org-constant">false</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">&#22914;&#26524; data &#26159;&#23383;&#31526;&#20018;&#30340;&#35805;&#19981;&#22788;&#29702;&#65292;&#21542;&#21017;&#35843;&#29992; $.params(data, tranditional) =&gt; 'aaa=222&amp;bbb=333'</span>
    tranditional: <span class="org-constant">false</span>|<span class="org-constant">true</span>,

    dataType: <span class="org-string">'json?xml?html?text'</span>, <span class="org-comment-delimiter">// </span><span class="org-comment">&#40664;&#35748;&#26681;&#25454; response &#22836;&#37096;&#30340;&#20449;&#24687;&#33258;&#21160;&#25512;&#27979;</span>
    xhrFields, cache, accepts, contents, crossDomain, conerters, jsonp, mimeType, timeout
}).done((data) =&gt; {  <span class="org-comment-delimiter">// </span><span class="org-comment">data &#30340;&#31867;&#22411;&#65292;&#30001; dataType &#20915;&#23450;</span>
    console.log(json.xxx)
}).fail((xhr, status, err) { <span class="org-comment-delimiter">// </span><span class="org-comment">&#21442;&#25968;&#20998;&#21035;&#26159; ajax &#21407;&#29983;&#23545;&#35937;&#65292;&#38169;&#35823;&#29366;&#24577;&#65292;&#20197;&#21450;&#38169;&#35823;&#23545;&#35937;</span>
    console.error(err);
}).always(() =&gt; {
    console.log(<span class="org-string">"&#32456;&#20110;&#32467;&#26463;&#20102;"</span>);
});
</pre>
</div>

<p>
发送 JSON 到服务器:
</p>
<div class="org-src-container">
<pre class="src src-js">$.ajax({
    url: <span class="org-string">'/xxx'</span>,
    method: <span class="org-string">'post'</span>,
    contentType: <span class="org-string">'application/json'</span>,
    data: JSON.parse({
        name: <span class="org-string">'xxx'</span>, age: 12
    }),
}).done((data) =&gt; {  <span class="org-comment-delimiter">// </span><span class="org-comment">data &#30340;&#31867;&#22411;&#65292;&#30001; dataType &#20915;&#23450;</span>
    console.log(json.xxx)
}).fail((xhr, status, err) { <span class="org-comment-delimiter">// </span><span class="org-comment">&#21442;&#25968;&#20998;&#21035;&#26159; ajax &#21407;&#29983;&#23545;&#35937;&#65292;&#38169;&#35823;&#29366;&#24577;&#65292;&#20197;&#21450;&#38169;&#35823;&#23545;&#35937;</span>
    console.error(err);
}).always(() =&gt; {
    console.log(<span class="org-string">"&#32456;&#20110;&#32467;&#26463;&#20102;"</span>);
});
</pre>
</div>

<p>
发送 formData 到服务器:
</p>
<div class="org-src-container">
<pre class="src src-js"><span class="org-keyword">var</span> <span class="org-variable-name">formData</span> = <span class="org-keyword">new</span> <span class="org-type">FormData</span>();
formData.append(<span class="org-string">"name"</span>, <span class="org-string">"tomcat"</span>);

$.ajax({
    url: <span class="org-string">'/xxx'</span>,
    method: <span class="org-string">'post'</span>,
    contentType: <span class="org-string">'application/json'</span>,
    data: formData,
    processData: <span class="org-constant">false</span> <span class="org-comment-delimiter">// </span><span class="org-comment">&#19981;&#35201;&#23558; formData &#36716;&#25442;&#20026; xxx=222&amp;yyy=333 &#30340;&#26041;&#24335;</span>
}).done((data) =&gt; {
    console.log(json.xxx)
}).fail((xhr, status, err) {
    console.error(err);
}).always(() =&gt; {
    console.log(<span class="org-string">"&#32456;&#20110;&#32467;&#26463;&#20102;"</span>);
});
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2018-11-06 周二 03:47</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
